using System;

namespace CorePass.CLI
{
    public static class HeaderDrawer
    {
        public static void Draw()
        {
            Console.ForegroundColor = ConsoleColor.DarkRed;
            Console.WriteLine(@"
================================= CorePass CLI v2.0 ================================
____________________________________________________________________________________
_______________   _________________________________________________   ______________
RedZ1@viA23$?@3| |                                                 | |3$erRfCsA-X!&6
aScs@3bÑdff@109| |  ___|                     _ \                   | |dR4Tg%5ãCxç]0!              
ÃcvSv*d2bj#f5%t| | |       _ \    __|  _ \  |   |  _` |   __|   __|| |@dcCvdfõ2fá9W1
B12f;+F$Nãoc30?| | |      (   |  |     __/  ___/  (   | \__ \ \__ \| |0&rCb?c>[$cXÔi
cFv2&tg0áô0?[!d| |\____| \___/  _|   \___| _|    \__,_| ____/ ____/| |42tGv6üzÇ)2SxG
s͟6͟Ü͟v͟@͟x͟S͟z͟!͟4͟õ͟P͟l͟s͟$͟| |_________________________________________________| |3͟%͟f͟Cx͟Z͟c͟s͟k͟a͟#͟Ñ͟)͟!͟
____________________________________________________________________________________
");
            Console.ResetColor();
        }
    }
}
